#! /usr/bin/env racket
#lang racket
(require racket/trace)

;map
;filter
;foldr
;e = l1 l2 l3 ... ln
;
;(define balance 100)
;(define (withdraw a)
;  (let balance 100)
;  (if (>= balance a)
;    (begin (set! balance (- balance a))
;    balance
;    )
;    "Недостаточно средств"
;  )
;)

;###############################################################################
;################################# Счет ########################################
;###############################################################################
(define (make-withdraw balance)
  (define (withdraw a)
    (if (>= balance a)
      (begin (set! balance (- balance a))
      balance
      )
      "Недостаточно средств"
    )
  )
  (lambda (mes a)
    (cond
      ((eq? mes 'add) (withdraw (- a)))
      ((eq? mes 'get) (withdraw a))
      (else "Неизвестное сообщение")
    )
  )
)
;###############################################################################
;############################### Аккумулятор ###################################
;###############################################################################
(define (make-accum start)
  (define (add x)
    (begin (set! start (+ start x))
    start
    )
  )
  (define (set x)
    (begin (set! start x)
    start
    )
  )
  (lambda (mes)
    (cond
      ((eq? mes 'add) add)
      ((eq? mes 'zer) (set 0))
      ((eq? mes 'prnt) start)
      (else "Непонятная команда")
    )
  )
)

(define add 'add)
(define get 'get)
(define zer 'zer)
(define prnt 'prnt)
;########################
;Д/З
;Модифицировать банковский счет с паролем. если пароль правильный дает ошибку если 3-й раз неправильный то вызов полиции.
;###############################################################################
;############################## Примеры ########################################
;###############################################################################
;Все функции задаются
;Нарисовать ((acc 'd) 25)
(define b1 (make-accum 1000))
(b1 prnt)
((b1 add) 20)
((b1 add) 20)
((b1 add) 20)
(b1 zer)
;(b2 100)
;(b2 150)
